TcIdentityChecker/Service References/KPSKimlik/KisiSorgulaTCKimlikNoServis.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://kps.nvi.gov.tr/2011/01/01" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="KisiSorgulaTCKimlikNoServis" targetNamespace="http://kps.nvi.gov.tr/2011/01/01" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsp:Policy wsu:Id="CustomBinding_KisiSorgulaTCKimlikNoServis_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:TransportBinding xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
          <wsp:Policy>
            <sp:TransportToken>
              <wsp:Policy>
                <sp:HttpsToken />
              </wsp:Policy>
            </sp:TransportToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic256 />
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Strict />
              </wsp:Policy>
            </sp:Layout>
            <sp:IncludeTimestamp />
          </wsp:Policy>
        </sp:TransportBinding>
        <sp:EndorsingSupportingTokens xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
          <wsp:Policy>
            <sp:IssuedToken sp:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/AlwaysToRecipient">
              <Issuer xmlns="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
                <Address xmlns="http://www.w3.org/2005/08/addressing">https://kimlikdogrulama.nvi.gov.tr/Services/Issuer.svc/IWSTrust13</Address>
                <Metadata xmlns="http://www.w3.org/2005/08/addressing">
                  <Metadata xmlns="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <wsx:MetadataSection xmlns="" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex">
                      <wsx:MetadataReference>
                        <Address xmlns="http://www.w3.org/2005/08/addressing">https://kimlikdogrulama.nvi.gov.tr/Services/Issuer.svc/mex</Address>
                      </wsx:MetadataReference>
                    </wsx:MetadataSection>
                  </Metadata>
                </Metadata>
              </Issuer>
              <sp:RequestSecurityTokenTemplate>
                <trust:KeyType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/ws-sx/ws-trust/200512/SymmetricKey</trust:KeyType>
              </sp:RequestSecurityTokenTemplate>
              <wsp:Policy>
                <sp:RequireInternalReference />
              </wsp:Policy>
            </sp:IssuedToken>
          </wsp:Policy>
        </sp:EndorsingSupportingTokens>
        <sp:Wss11 xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
          <wsp:Policy />
        </sp:Wss11>
        <sp:Trust13 xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
          <wsp:Policy>
            <sp:MustSupportIssuedTokens />
            <sp:RequireClientEntropy />
            <sp:RequireServerEntropy />
          </wsp:Policy>
        </sp:Trust13>
        <wsaw:UsingAddressing />
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsdl:types>
    <xsd:schema elementFormDefault="qualified" targetNamespace="http://kps.nvi.gov.tr/2011/01/01">
      <xsd:element name="ListeleCoklu">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element minOccurs="0" name="kriterListesi" nillable="true" type="tns:ArrayOfKisiSorgulaTCKimlikNoSorguKriteri" />
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:complexType name="ArrayOfKisiSorgulaTCKimlikNoSorguKriteri">
        <xsd:sequence>
          <xsd:element minOccurs="0" maxOccurs="unbounded" name="KisiSorgulaTCKimlikNoSorguKriteri" nillable="true" type="tns:KisiSorgulaTCKimlikNoSorguKriteri" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="ArrayOfKisiSorgulaTCKimlikNoSorguKriteri" nillable="true" type="tns:ArrayOfKisiSorgulaTCKimlikNoSorguKriteri" />
      <xsd:complexType name="KisiSorgulaTCKimlikNoSorguKriteri">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="TCKimlikNo" nillable="true" type="xsd:long" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="KisiSorgulaTCKimlikNoSorguKriteri" nillable="true" type="tns:KisiSorgulaTCKimlikNoSorguKriteri" />
      <xsd:element name="ListeleCokluResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element minOccurs="0" name="ListeleCokluResult" nillable="true" type="tns:KisiBilgisiSonucu" />
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:complexType name="KisiBilgisiSonucu">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="HataBilgisi" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="SorguSonucu" nillable="true" type="tns:ArrayOfKisiBilgisi" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="KisiBilgisiSonucu" nillable="true" type="tns:KisiBilgisiSonucu" />
      <xsd:complexType name="Parametre">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="Aciklama" nillable="true" type="xsd:string" />
          <xsd:element minOccurs="0" name="Kod" nillable="true" type="xsd:int" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="Parametre" nillable="true" type="tns:Parametre" />
      <xsd:complexType name="ArrayOfKisiBilgisi">
        <xsd:sequence>
          <xsd:element minOccurs="0" maxOccurs="unbounded" name="KisiBilgisi" nillable="true" type="tns:KisiBilgisi" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="ArrayOfKisiBilgisi" nillable="true" type="tns:ArrayOfKisiBilgisi" />
      <xsd:complexType name="KisiBilgisi">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="AnneTCKimlikNo" nillable="true" type="xsd:long" />
          <xsd:element minOccurs="0" name="BabaTCKimlikNo" nillable="true" type="xsd:long" />
          <xsd:element minOccurs="0" name="DogumYerKod" nillable="true" type="xsd:int" />
          <xsd:element minOccurs="0" name="DurumBilgisi" nillable="true" type="tns:KisiDurumBilgisi" />
          <xsd:element minOccurs="0" name="EsTCKimlikNo" nillable="true" type="xsd:long" />
          <xsd:element minOccurs="0" name="HataBilgisi" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="KayitYeriBilgisi" nillable="true" type="tns:KisiKayitYeriBilgisi" />
          <xsd:element minOccurs="0" name="TCKimlikNo" nillable="true" type="xsd:long" />
          <xsd:element minOccurs="0" name="TemelBilgisi" nillable="true" type="tns:KisiTemelBilgisi" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="KisiBilgisi" nillable="true" type="tns:KisiBilgisi" />
      <xsd:complexType name="KisiDurumBilgisi">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="Din" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="Durum" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="MedeniHal" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="OlumTarih" nillable="true" type="tns:TarihBilgisi" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="KisiDurumBilgisi" nillable="true" type="tns:KisiDurumBilgisi" />
      <xsd:complexType name="TarihBilgisi">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="Ay" nillable="true" type="xsd:int" />
          <xsd:element minOccurs="0" name="Gun" nillable="true" type="xsd:int" />
          <xsd:element minOccurs="0" name="Yil" nillable="true" type="xsd:int" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="TarihBilgisi" nillable="true" type="tns:TarihBilgisi" />
      <xsd:complexType name="KisiKayitYeriBilgisi">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="AileSiraNo" nillable="true" type="xsd:int" />
          <xsd:element minOccurs="0" name="BireySiraNo" nillable="true" type="xsd:int" />
          <xsd:element minOccurs="0" name="Cilt" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="Il" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="Ilce" nillable="true" type="tns:Parametre" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="KisiKayitYeriBilgisi" nillable="true" type="tns:KisiKayitYeriBilgisi" />
      <xsd:complexType name="KisiTemelBilgisi">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="Ad" nillable="true" type="xsd:string" />
          <xsd:element minOccurs="0" name="AnneAd" nillable="true" type="xsd:string" />
          <xsd:element minOccurs="0" name="BabaAd" nillable="true" type="xsd:string" />
          <xsd:element minOccurs="0" name="Cinsiyet" nillable="true" type="tns:Parametre" />
          <xsd:element minOccurs="0" name="DogumTarih" nillable="true" type="tns:TarihBilgisi" />
          <xsd:element minOccurs="0" name="DogumYer" nillable="true" type="xsd:string" />
          <xsd:element minOccurs="0" name="Soyad" nillable="true" type="xsd:string" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="KisiTemelBilgisi" nillable="true" type="tns:KisiTemelBilgisi" />
    </xsd:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="KisiSorgulaTCKimlikNoServis_ListeleCoklu_InputMessage">
    <wsdl:part name="parameters" element="tns:ListeleCoklu" />
  </wsdl:message>
  <wsdl:message name="KisiSorgulaTCKimlikNoServis_ListeleCoklu_OutputMessage">
    <wsdl:part name="parameters" element="tns:ListeleCokluResponse" />
  </wsdl:message>
  <wsdl:portType name="KisiSorgulaTCKimlikNoServis">
    <wsdl:operation name="ListeleCoklu">
      <wsdl:input wsaw:Action="http://kps.nvi.gov.tr/2011/01/01/KisiSorgulaTCKimlikNoServis/ListeleCoklu" message="tns:KisiSorgulaTCKimlikNoServis_ListeleCoklu_InputMessage" />
      <wsdl:output wsaw:Action="http://kps.nvi.gov.tr/2011/01/01/KisiSorgulaTCKimlikNoServis/ListeleCokluResponse" message="tns:KisiSorgulaTCKimlikNoServis_ListeleCoklu_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="CustomBinding_KisiSorgulaTCKimlikNoServis" type="tns:KisiSorgulaTCKimlikNoServis">
    <wsp:PolicyReference URI="#CustomBinding_KisiSorgulaTCKimlikNoServis_policy" />
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="ListeleCoklu">
      <soap12:operation soapAction="http://kps.nvi.gov.tr/2011/01/01/KisiSorgulaTCKimlikNoServis/ListeleCoklu" style="document" />
      <wsdl:input>
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="KisiSorgulaTCKimlikNoServis">
    <wsdl:port name="CustomBinding_KisiSorgulaTCKimlikNoServis" binding="tns:CustomBinding_KisiSorgulaTCKimlikNoServis">
      <soap12:address location="https://kpsv2.nvi.gov.tr/Services/RoutingService.svc" />
      <wsa10:EndpointReference>
        <wsa10:Address>https://kpsv2.nvi.gov.tr/Services/RoutingService.svc</wsa10:Address>
      </wsa10:EndpointReference>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>